[["Something that stretches over an area or distance covers or exists in the whole of that area or distance.", "When you stretch, you put your arms or legs out straight and tighten your muscles.", "If something stretches from one time to another, it begins at the first time and ends at the second, which is longer than expected.", "If a group of things stretch from one type of thing to another, the group includes a wide range of things.", "When something soft or elastic stretches or is stretched, it becomes longer or bigger as well as thinner, usually because it is pulled.", "If you stretch an amount of something or if it stretches, you make it last longer than it usually would by being careful and not wasting any of it.", "If your resources can stretch to something, you can just afford to do it.", "If something stretches your money or resources, it uses them up so you have hardly enough for your needs.", "If you say that a job or task stretches you, you mean that you like it because it makes you work hard and use all your energy and skills so that you do not become bored or achieve less than you should.", "A stretch of road, water, or land is a length or area of it.", "A stretch of time is a period of time.", "Stretch fabric is soft and elastic and stretches easily.", "If you are at full stretch, you are using the maximum amount of effort or energy.", "If you say that something is not true or possible by any stretch of the imagination, you are emphasizing that it is completely untrue or absolutely impossible.", "If you stretch your legs, you go for a short walk, usually after you have been sitting down for a long time."], ["The procession stretched for several miles ", "an artificial reef stretching the length of the coast. ", "He yawned and stretched ", "Try stretching your legs and pulling your toes upwards ", "She arched her back and stretched herself. ", "a working day that stretches from seven in the morning to eight at night. ", "a trading empire, with interests that stretched from chemicals to sugar. ", "The cables are designed not to stretch ", "Ease the pastry into the corners of the tin, making sure you don't stretch it. ", "During his senior year his earnings stretched far enough to buy an old car. ", "They're used to stretching their budgets ", "She suggested to me that I might like to start regular savings and I said Well, I don't know whether I can stretch to that. ", "The drought there is stretching American resources ", "Public expenditure was being stretched to the limit by having to support 3 million unemployed people. ", "They criticised the quality of teaching, claiming pupils were not stretched enough. ", "I'm trying to move on and stretch myself with something different ", "It's a very dangerous stretch of road ", "He would study for eight to ten hours at a stretch. ", "after an 18-month stretch in the army ", "stretch cotton swimsuits. ", "stretch fabrics such as Lycra. ", "Everyone would be working at full stretch. ", "Her husband was not a womaniser by any stretch of the imagination ", "I stopped at the square and got out to stretch my legs. "]]