[["If you shake something, you hold it and move it quickly backwards and forwards or up and down. You can also shake a person, for example, because you are angry with them or because you want them to wake up.", "If you shake yourself or your body, you make a lot of quick, small, repeated movements without moving from the place where you are.", "If you shake your head, you turn it from side to side in order to say `no' or to show disbelief or sadness.", "If you are shaking, or a part of your body is shaking, you are making quick, small movements that you cannot control, for example because you are cold or afraid.", "If you shake your fist or an object such as a stick at someone, you wave it in the air in front of them because you are angry with them.", "If a force shakes something, or if something shakes, it moves from side to side or up and down with quick, small, but sometimes violent movements.", "To shake something into a certain place or state means to bring it into that place or state by moving it quickly up and down or from side to side.", "If your voice is shaking, you cannot control it properly and it sounds very unsteady, for example because you are nervous or angry.", "If an event or a piece of news shakes you, or shakes your confidence, it makes you feel upset and unable to think calmly.", "If an event shakes a group of people or their beliefs, it causes great uncertainty and makes them question their beliefs.", "A shake is the same as a milkshake.", "If you say that someone or something is no great shakes, you mean that they are not very skilful or effective.", "If you shake someone's hand or shake someone by the hand, you shake hands with them.", "If you shake hands with someone, you take their right hand in your own for a few moments, often moving it up and down slightly, when you are saying hello or goodbye to them, congratulating them, or agreeing on something. You can also say that two people shake hands."], ["The nurse shook the thermometer and put it under my armpit ", "Shake the rugs well and hang them for a few hours before replacing on the floor ", "As soon as he got inside, the dog shook himself ", "He shook his hands to warm them up. ", "'Anything else?' Colum asked. Kathryn shook her head wearily ", "My hand shook so much that I could hardly hold the microphone ", "I stood there, crying and shaking with fear. ", "The colonel rushed up to Earle, shaking his gun at him ", "an explosion that shook buildings several kilometers away ", "The breeze grew in strength, the flags shook, plastic bunting creaked. ", "Small insects can be collected by shaking them into a jar ", "Shake off any excess flour before putting livers in the pan ", "His voice shaking with rage, he asked how the committee could keep such a report from the public. ", "The news of Tandy's escape had shaken them all ", "It won't shake the football world if we beat Torquay ", "He sent his driver to fetch him a strawberry shake. ", "I'm no great shakes as a detective ", "The protests have failed partly because the opposition politicians are no great shakes. ", "I said congratulations and walked over to him and shook his hand ", "He nodded greetings to Mary Ann and Michael and shook hands with Burke "]]