[["If there is a flood, a large amount of water covers an area which is usually dry, for example when a river flows over its banks or a pipe bursts.", "If you say that a flood of people or things arrive somewhere, you are emphasizing that a very large number of them arrive there.", "If something such as a river or a burst pipe floods an area that is usually dry or if the area floods, it becomes covered with water.", "If a river floods, it overflows, especially after very heavy rain.", "If you say that people or things flood into a place, you are emphasizing that they arrive there in large numbers.", "If you flood a place with a particular type of thing, or if a particular type of thing floods a place, the place becomes full of so many of them that it cannot hold or deal with any more.", "If an emotion, feeling, or thought floods you, you suddenly feel it very intensely. If feelings or memories flood back, you suddenly remember them very clearly.", "If light floods a place or floods into it, it suddenly fills it.", "If you say that someone was in floods of tears or in a flood of tears, you are emphasizing that they were crying with great intensity because they were very upset."], ["More than 70 people were killed in the floods, caused when a dam burst ", "This is the type of flood dreaded by cavers ", "Over 25 people drowned when a schoolbus tried to cross a river and flood waters swept through. ", "The administration is trying to stem the flood of refugees out of Haiti and into Florida ", "He received a flood of letters from irate constituents. ", "The Chicago River flooded the city's underground tunnel system ", "The kitchen flooded. ", "the relentless rain that caused twenty rivers to flood ", "The writing is on the wall for the club unless they can find ￡20,000. ", "Enquiries flooded in from all over the world. ", "the refugees flooding out of Kosovo. ", "a policy aimed at flooding Europe with exports ", "German cameras at knock-down prices flooded the British market. ", "A wave of happiness flooded me ", "Mary Ann was flooded with relief ", "It was probably the shock which had brought all the memories flooding back. ", "The afternoon light flooded the little rooms ", "Morning sunshine flooded in through the open curtains. ", "They said goodbye in a flood of tears. "]]