[["Thread or a thread is a long very thin piece of a material such as cotton, nylon, or silk, especially one that is used in sewing.", "The thread of an argument, a story, or a situation is an aspect of it that connects all the different parts together.", "A thread of something such as liquid, light, or colour is a long thin line or piece of it.", "The thread on a screw, or on something such as a lid or a pipe, is the raised spiral line of metal or plastic around it which allows it to be fixed in place by twisting.", "If you thread your way through a group of people or things, or thread through it, you move through it carefully or slowly, changing direction frequently as you move.", "If you thread a long thin object through something, you pass it through one or more holes or narrow spaces.", "If you thread small objects such as beads onto a string or thread, you join them together by pushing the string through them.", "When you thread a needle, you put a piece of thread through the hole in the top of the needle in order to sew with it.", "If you say that something is hanging by a thread, you mean that it is in a very uncertain state and is unlikely to survive or succeed.", "If you pick up the threads of an activity, you start it again after an interruption. If you pick up the threads of your life, you become more active again after a period of failure or bad luck."], ["a tiny Nepalese hat embroidered with golden threads. ", "The thread running through many of these proposals was the theme of individual power and opportunity ", "A thin, glistening thread of moisture ran along the rough concrete sill. ", "The screw threads will be able to get a good grip. ", "Slowly she threaded her way back through the moving mass of bodies ", "We threaded through a network of back streets. ", "threading the laces through the eyelets of his shoes ", "Instruments developed at the hospital allow doctors to thread microscopic telescopes into the digestive tract. ", "Wipe the mushrooms clean and thread them on a string. ", "I sit down, thread a needle, snip off an old button. ", "The fragile peace was hanging by a thread as thousands of hardliners took to the streets. ", "Many women have been able to pick up the threads of their former career. "]]