[["A flash is a sudden burst of light or of something shiny or bright.", "You talk about a flash of something when you are saying that it happens very suddenly and unexpectedly.", "Flash is the use of special bulbs to give more light when taking a photograph.", "A flash is the same as a flashlight.", "If a light flashes or if you flash a light, it shines with a sudden bright light, especially as quick, regular flashes of light.", "If something flashes past or by, it moves past you so fast that you cannot see it properly.", "If something flashes through or into your mind, you suddenly think about it.", "If you flash something such as an identity card, you show it to people quickly and then put it away again.", "If a picture or message flashes up on a screen, or if you flash it onto a screen, it is displayed there briefly or suddenly, and often repeatedly.", "If you flash news or information to a place, you send it there quickly by computer, satellite, or other system.", "If you flash a look or a smile at someone, you suddenly look at them or smile at them.", "If someone's eyes flash, they suddenly show a strong emotion, especially anger.", "If you describe something as flash, you mean that it looks expensive, fashionable, and new.", "If you describe an achievement or success as a flash in the pan, you mean that it is unlikely to be repeated and is not an indication of future achievements or success.", "If you say that something happens in a flash, you mean that it happens suddenly and lasts only a very short time.", "If you say that someone reacts to something quick as a flash, you mean that they react to it extremely quickly."], ["A sudden flash of lightning lit everything up for a second ", "The wire snapped at the wall plug with a blue flash and the light fused ", "A jay emerged from the juniper bush in a flash of blue feathers. ", "'What did Moira tell you?' Liz demanded with a flash of anger ", "The essays could do with a flash of wit or humor. ", "He was one of the first people to use high speed flash in bird photography. ", "Stopping to rest, Pete shut off the flash. ", "He lost his temper after a driver flashed her headlights as he overtook ", "He saw the flashing lights of the highway patrol car in his driving mirror. ", "Lightning flashed among the distant dark clouds ", "It was a busy road, cars flashed by every few minutes. ", "A ludicrous thought flashed through Harry's mind ", "Halim flashed his official card, and managed to get hold of a soldier to guard the Land Rover. ", "The screen flashes a message: Try again ", "The words 'Good Luck' were flashing on the screen ", "Researchers flash two groups of different letters onto a computer screen ", "A list of items is repeatedly flashed up on the screen. ", "The figures flash up on the scoreboard ", "They had told their offices to flash the news as soon as it broke ", "This is, of course, international news and soon it was being flashed around the world. ", "I flashed a look at Sue ", "Meg flashed Cissie a grateful smile. ", "Her dark eyes flashed and she spoke rapidly. ", "You can go for a 'rostrum' system, which sounds flash, but can be assembled quite cheaply. ", "a flash uptown restaurant ", "People will be looking in to see how good we are now and whether our success has just been a flash in the pan. ", "The answer had come to him in a flash ", "It was done in a flash. ", "Quick as a flash, the man said, 'I have to, don't I?' "]]