[["A sink is a large fixed container in a kitchen, with taps to supply water. It is mainly used for washing dishes.", "A sink is the same as a washbasin or basin.", "If a boat sinks or if someone or something sinks it, it disappears below the surface of a mass of water.", "If something sinks, it disappears below the surface of a mass of water.", "If something sinks, it moves slowly downwards.", "If something sinks to a lower level or standard, it falls to that level or standard.", "If your heart or your spirits sink, you become depressed or lose hope.", "If something sharp sinks or is sunk into something solid, it goes deeply into it.", "If someone sinks a well, mine, or other large hole, they make a deep hole in the ground, usually by digging or drilling.", "If you sink money into a business or project, you spend money on it in the hope of making more money.", "People use sink school or sink estate to refer to a school or housing estate that is in a very poor area with few resources.", "If you say that someone will have to sink or swim, you mean that they will have to succeed through their own efforts, or fail."], ["The sink was full of dirty dishes. ", "the kitchen sink. ", "The bathroom is furnished with 2 toilets, 2 showers, and 2 sinks. ", "In a naval battle your aim is to sink the enemy's ship ", "The boat was beginning to sink fast ", "The lifeboat crashed against the side of the sinking ship. ", "A fresh egg will sink and an old egg will float. ", "Far off to the west the sun was sinking ", "Share prices would have sunk-hurting small and big investors ", "Pay increases have sunk to around seven per cent ", "The pound had sunk 10 per cent against the Schilling. ", "My heart sank because I thought he was going to dump me for another girl ", "I sank my teeth into a peppermint cream ", "The spade sank into a clump of overgrown bushes. ", "the site where Stephenson sank his first mineshaft ", "He has already sunk $25million into the project. ", "unemployed teenagers from sink estates ", "The government doesn't want to force inefficient firms to sink or swim too quickly "]]