[["To extract a substance means to obtain it from something else, for example by using industrial or chemical processes.", "If you extract something from a place, you take it out or pull it out.", "When a dentist extracts a tooth, they remove it from the patient's mouth.", "If you say that someone extracts something, you disapprove of them because they take it for themselves to gain an advantage.", "If you extract information or a response from someone, you get it from them with difficulty, because they are unwilling to say or do what you want.", "If you extract a particular piece of information, you obtain it from a larger amount or source of information.", "If part of a book or text is extracted from a particular book, it is printed or published.", "An extract from a book or piece of writing is a small part of it that is printed or published separately.", "An extract is a substance that has been obtained from something else, for example by means of a chemical or industrial process."], ["the traditional method of pick and shovel to extract coal ", "Citric acid can be extracted from the juice of oranges, lemons, limes or grapefruit. ", "looking at the differences in the extracted DNA. ", "He extracted a small notebook from his hip pocket ", "Patterson went straight to the liquor cabinet and extracted a bottle of Scotch ", "A dentist may decide to extract the tooth to prevent recurrent trouble ", "She is to go and have a tooth extracted at 3 o'clock today. ", "He sought to extract the maximum political advantage from the cut in interest rates ", "He made the mistake of trying to extract further information from our director ", "I've simply extracted a few figures ", "Britain's trade figures can no longer be extracted from export-and-import documentation at ports. ", "This material has been extracted from 'Collins Good Wood Handbook'. ", "Read this extract from an information booklet about the work of an airline cabin crew. ", "Blend in the lemon extract, lemon peel and walnuts. "]]