[["If you bet on the result of a horse race, football game, or other event, you give someone a sum of money which they give you back with extra money if the result is what you predicted, or which they keep if it is not.", "If someone is betting that something will happen, they are hoping or expecting that it will happen.", "A bet is a sum of money which you give to someone when you bet.", "You use expressions such as `I bet', `I'll bet', and `you can bet' to indicate that you are sure something is true.", "If you tell someone that something is a good bet, you are suggesting that it is the thing or course of action that they should choose.", "If you say that it is a good bet or a safe bet that something is true or will happen, you are saying that it is extremely likely to be true or to happen.", "If you hedge your bets, you follow two courses of action to avoid making a decision between two things because you cannot decide which one is right.", "You use I bet or I'll bet in reply to a statement to show that you agree with it or that you expected it to be true, usually when you are annoyed or amused by it.", "You can use my bet is or it's my bet to give your personal opinion about something, when you are fairly sure that you are right.", "If you say don't bet on something or I wouldn't bet on something, you mean that you do not think that something is true or will happen.", "You use `You bet' or `you bet your life' to say yes in an emphatic way or to emphasize a reply or statement.", "If you reply `Do you want to bet?' or `Want a bet?' to someone, you mean you are certain that what they have said is wrong."], ["Jockeys are forbidden to bet on the outcome of races ", "I bet ￡10 on a horse called Premonition ", "He bet them 500 pounds they would lose. ", "The party is betting that the presidential race will turn into a battle for younger voters ", "People were betting on a further easing of credit conditions. ", "You can put a bet on almost anything these days. ", "I bet you were good at games when you were at school ", "I'll bet they'll taste out of this world ", "Your best bet is to choose a guest house. ", "It is a safe bet that the current owners will not sell. ", "NASA is hedging its bets and adopting both strategies. ", "'I'd like to ask you something,' I said. 'I bet you would,' she grinned. ", "My bet is that next year will be different ", "It's my bet that he's the guy behind this killing. ", "'We'll never get a table in there'-'Don't bet on it.' ", "'It's settled, then?'-'You bet.' ", "'Are you afraid of snakes?'-'You bet your life I'm afraid of snakes.' ", "'Money can't buy happiness'-'Want to bet?' "]]