[["When you seal an envelope, you close it by folding part of it over and sticking it down, so that it cannot be opened without being torn.", "If you seal a container or an opening, you cover it with something in order to prevent air, liquid, or other material getting in or out. If you seal something in a container, you put it inside and then close the container tightly.", "If someone in authority seals an area, they stop people entering or passing through it, for example by placing barriers in the way.", "To seal something means to make it definite or confirm how it is going to be.", "The seal on a container or opening is the part where it has been sealed.", "A seal is a device or a piece of material, for example in a machine, which closes an opening tightly so that air, liquid, or other substances cannot get in or out.", "A seal is something such as a piece of sticky paper or wax that is fixed to a container or door and must be broken before the container or door can be opened.", "A seal is a special mark or design, for example on a document, representing someone or something. It may be used to show that something is genuine or officially approved.", "If something sets or puts the seal on something, it makes it definite or confirms how it is going to be.", "If a document is under seal, it is in a sealed envelope and cannot be looked at, for example because it is private."], ["He sealed the envelope and put on a stamp ", "Write your letter and seal it in a blank envelope ", "A courier was despatched with two sealed envelopes. ", "She merely filled the containers, sealed them with a cork, and pasted on labels ", "a hermetically sealed, leak-proof packet. ", "a lid to seal in heat and keep food moist. ", "The soldiers were deployed to help paramilitary police seal the border ", "A wide area round the two-storey building is sealed to all traffic except the emergency services. ", "McLaren are close to sealing a deal with Renault ", "His artistic character was sealed by his experiences of the First World War. ", "When assembling the pie, wet the edges where the two crusts join, to form a seal. ", "Check seals on fridges and freezers regularly. ", "The seal on the box broke when it fell from its hiding-place ", "a supply of note paper bearing the Presidential seal ", "Such a visit may set the seal on a new relationship between the two governments ", "Because the transcript is still under seal, I am precluded by law from discussing the evidence. "]]