[["A tune is a series of musical notes that is pleasant and easy to remember.", "You can refer to a song or a short piece of music as a tune.", "When someone tunes a musical instrument, they adjust it so that it produces the right notes.", "When an engine or machine is tuned, it is adjusted so that it works well.", "If your radio or television is tuned to a particular broadcasting station, you are listening to or watching the programmes being broadcast by that station.", "If you say that a person or organization is calling the tune, you mean that they are in a position of power or control in a particular situation.", "If you say that someone has changed their tune, you are criticizing them because they have changed their opinion or way of doing things.", "If you say that someone is dancing to someone else's tune, you mean that they are allowing themselves to be controlled by the other person.", "A person or musical instrument that is in tune produces exactly the right notes. A person or musical instrument that is out of tune does not produce exactly the right notes.", "If you are in tune with a group of people, you are in agreement or sympathy with them. If you are out of tune with them, you are not in agreement or sympathy with them.", "To the tune of a particular amount of money means to the extent of that amount."], ["She was humming a merry little tune. ", "She'll also be playing your favourite pop tunes. ", "'We do tune our guitars before we go on,' he insisted. ", "Drivers are urged to make sure that car engines are properly tuned. ", "A small colour television was tuned to an afternoon soap opera. ", "Who would then be calling the tune in Parliament? ", "You've changed your tune since this morning, haven't you? ", "The danger of commercialism is that the churches end up dancing to the tune of their big business sponsors. ", "Many of the notes are out of tune ", "It was just an ordinary voice, but he sang in tune ", "Today, his change of direction seems more in tune with the times ", "The peace campaigners were probably out of tune with most Britons. ", "They've been sponsoring the World Cup to the tune of a million and a half pounds. "]]