[["If you bite something, you use your teeth to cut into it, for example in order to eat it or break it. If an animal or person bites you, they use their teeth to hurt or injure you.", "If a snake or a small insect bites you, it makes a mark or hole in your skin, and often causes the surrounding area of your skin to become painful or itchy.", "When an action or policy begins to bite, it begins to have a serious or harmful effect.", "If an object bites into a surface, it presses hard against it or cuts into it.", "If a fish bites when you are fishing, it takes the hook or bait at the end of your fishing line in its mouth.", "A bite of something, especially food, is the action of biting it.", "If you have a bite to eat, you have a small meal or a snack.", "A bite is an injury or a mark on your body where an animal, snake, or small insect has bitten you.", "If you say that a food or drink has bite, you like it because it has a strong or sharp taste.", "If the air or the wind has a bite, it feels very cold.", "If someone bites the hand that feeds them, they behave badly or in an ungrateful way towards someone who they depend on.", "If you bite your lip or your tongue, you stop yourself from saying something that you want to say, because it would be the wrong thing to say in the circumstances.", "If something takes a bite out of a sum of money, part of the money is spent or taken away in order to pay for it."], ["Both sisters bit their nails as children ", "He had bitten the cigarette in two ", "Llamas won't bite or kick. ", "He bit into his sandwich ", "We were all badly bitten by mosquitoes. ", "As the sanctions begin to bite there will be more political difficulties ahead ", "The recession started biting deeply into British industry. ", "There may even be some wire or nylon biting into the flesh ", "After half an hour, the fish stopped biting and we moved on. ", "He took another bite of apple ", "You cannot eat a bun in one bite. ", "It was time to go home for a little rest and a bite to eat. ", "Any dog bite, no matter how small, needs immediate medical attention. ", "the addition of tartaric acid to give the wine some bite. ", "There was a bite in the air, a smell perhaps of snow. ", "She may be cynical about the film industry, but ultimately she has no intention of biting the hand that feeds her. ", "I must learn to bite my lip ", "He bit his tongue as he found himself on the point of saying 'follow that car'. ", "Local taxes are going to be taking a bigger bite out of people's income than they ever have before. "]]