[["When you bend, you move the top part of your body downwards and forwards. Plants and trees also bend.", "When you bend your head, you move your head forwards and downwards.", "When you bend a part of your body such as your arm or leg, or when it bends, you change its position so that it is no longer straight.", "If you bend something that is flat or straight, you use force to make it curved or to put an angle in it.", "When a road, beam of light, or other long thin thing bends, or when something bends it, it changes direction to form a curve or angle.", "If someone bends to your wishes, they believe or do something different, usually when they do not want to.", "If you bend rules or laws, you interpret them in a way that allows you to do something they would not normally allow you to do.", "If you bend the truth or bend the facts, you say something that is not exactly true.", "A bend in a road, pipe, or other long thin object is a curve or angle in it.", "If you say that someone is bending over backwards to be helpful or kind, you are emphasizing that they are trying very hard to be helpful or kind.", "If you say that someone or something drives you round the bend, you mean that you dislike them and they annoy or upset you very much."], ["I bent over and kissed her cheek ", "She bent and picked up a plastic bucket ", "She was bent over the sink washing the dishes. ", "Rick appeared, bending his head a little to clear the top of the door. ", "These cruel devices are designed to stop prisoners bending their legs ", "As you walk faster, you will find the arms bend naturally and more quickly. ", "Bend the bar into a horseshoe ", "She'd cut a jagged hole in the tin, bending a knife in the process. ", "The road bent slightly to the right ", "Glass bends light of different colours by different amounts. ", "Congress has to bend to his will ", "Do you think she's likely to bend on her attitude to Europe? ", "A minority of officers were prepared to bend the rules. ", "Sometimes we bend the truth a little in order to spare them the pain of the real facts. ", "The crash occurred on a sharp bend. ", "People are bending over backwards to please customers. ", "And can you make that tea before your fidgeting drives me completely round the bend. "]]