[["If you kick someone or something, you hit them forcefully with your foot.", "When you kick a ball or other object, you hit it with your foot so that it moves through the air.", "If you kick or if you kick your legs, you move your legs with very quick, small, and forceful movements, once or repeatedly.", "If you kick your legs, you lift your legs up very high one after the other, for example when you are dancing.", "If you kick a habit, you stop doing something that is bad for you and that you find difficult to stop doing.", "If something gives you a kick, it makes you feel very excited or very happy for a short period of time.", "If you say that someone kicks you when you are down, you think they are behaving unfairly because they are attacking you when you are in a weak position.", "If you say that someone does something for kicks, you mean that they do it because they think it will be exciting.", "If you say that someone is dragged kicking and screaming into a particular course of action, you are emphasizing that they are very unwilling to do what they are being made to do.", "If you describe an event as a kick in the teeth, you are emphasizing that it is very disappointing and upsetting.", "You use kick yourself in expressions such as I could have kicked myself and you're going to kick yourself to indicate that you were annoyed or are going to be annoyed that you got something wrong."], ["The fiery actress kicked him in the shins ", "He kicked the door hard ", "He threw me to the ground and started to kick ", "An ostrich can kick a man to death. ", "He escaped by kicking open the window ", "I went to kick the ball and I completely missed it ", "He kicked the ball away ", "A furious player kicked his racket into the grandstand. ", "They were dragged away struggling and kicking ", "First he kicked the left leg, then he kicked the right ", "He kicked his feet away from the window. ", "He was kicking his legs like a Can Can dancer ", "She begins dancing, kicking her legs high in the air. ", "She's kicked her drug habit and learned that her life has value ", "I got a kick out of seeing my name in print. ", "In the end I just couldn't kick Jimmy when he was down. ", "They made a few small bets for kicks. ", "He had to be dragged kicking and screaming into action. ", "We've been struggling for years and it's a real kick in the teeth to see a new band make it ahead of us. ", "I was still kicking myself for not paying attention "]]