[["If you drain a liquid from a place or object, you remove the liquid by causing it to flow somewhere else. If a liquid drains somewhere, it flows there.", "If you drain a place or object, you dry it by causing water to flow out of it. If a place or object drains, water flows out of it until it is dry.", "If you drain food or if food drains, you remove the liquid that it has been in, especially after it has been cooked or soaked in water.", "If the colour or the blood drains or is drained from someone's face, they become very pale. You can also say that someone's face drains or is drained of colour.", "If something drains you, it leaves you feeling physically and emotionally exhausted.", "If you say that a country's or a company's resources or finances are drained, you mean that they are used or spent completely.", "A drain is a pipe that carries water or sewage away from a place, or an opening in a surface that leads to the pipe.", "If you say that something is a drain on an organization's finances or resources, you mean that it costs the organization a large amount of money, and you do not consider that it is worth it.", "If you say that something is going down the drain, you mean that it is being destroyed or wasted.", "If you say that a business is going down the drain, you mean that it is failing financially."], ["Miners built the tunnel to drain water out of the mines ", "Now the focus is on draining the water ", "Springs and rivers that drain into lakes carry dissolved nitrates and phosphates ", "Vast numbers of people have been mobilised to drain flooded land ", "The soil drains freely and slugs aren't a problem. ", "Drain the pasta well, arrange on four plates and pour over the sauce ", "Wash the leeks thoroughly and allow them to drain. ", "Jock's face had been suddenly drained of all colour ", "Thacker's face drained of colour ", "Harry felt the colour drain from his face ", "My emotional turmoil had drained me. ", "The state's finances have been drained by war ", "The company has steadily drained its cash reserves. ", "Tony built his own house and laid his own drains. ", "an ultra-modern printing plant, which has been a big drain on resources ", "They were aware that their public image was rapidly going down the drain ", "Small local stores are going down the drain. "]]